cases/openfoam.org/AMIBaffles/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet 
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -0.2;
        value           uniform (0 0 0);
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    innerWall 
    {
        type            noSlip;
    }

    outerWall 
    {
        type            noSlip;
    }

    pipe    
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    AMI1
    {
        type            cyclicAMI;
    }

    AMI2
    {
        type            cyclicAMI;
    }

    front
    {
        type            empty;
    }

    back 
    {
        type            empty;
    }
}

// ************************************************************************* //
