cases/openfoam.org/AMIBaffles/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime 4;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.025;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo           0.9;

maxDeltaT       0.01;

libs
(
    "libsolverFunctionObjects.so"
);

functions
{
    passiveScalar
    {
        type            scalarTransport;
        writeControl    outputTime;
        field           S;
        D               1e-6;
        autoSchemes     true;
        nCorr           0;
        resetOnStartUp  false;
    }

    #includeFunc residuals
}

// ************************************************************************* //
